---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BuildingPad.GetBoundary
source: html/0746069a-e9d2-2056-4e35-639799579d8f.htm
---
# Autodesk.Revit.DB.Architecture.BuildingPad.GetBoundary Method

Gets the boundary of current BuildingPad element.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundary()
```

## Returns
The curve loops that represent the boundary of the BuildingPad.